 <div class="row">
        <div class="col-lg-9">
            <h1>610.Triangle Judgement</h1>
            <div class="markdown-body" style="margin-top: 20px">
                A pupil Tim gets homework to identify whether three line segments could possibly form a triangle.
<p>&nbsp;</p>
However, this assignment is very heavy because there are hundreds of records to calculate.

<p>&nbsp;</p>
Could you help Tim by writing a query to judge whether these three sides can form a triangle, assuming table <code>triangle</code> holds the length of the three sides x, y and z.

<p>&nbsp;</p>

<pre>
| x  | y  | z  |
|----|----|----|
| 13 | 15 | 30 |
| 10 | 20 | 15 |
</pre>
For the sample data above, your query should return the follow result:

<pre>
| x  | y  | z  | triangle |
|----|----|----|----------|
| 13 | 15 | 30 | No       |
| 10 | 20 | 15 | Yes      |
</pre>

</div>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [3]:
triangle = pd.read_sql_table("triangle", engine)
triangle

    x   y   z
0  13  15  30
1  10  20  15

In [4]:
query = '''
SELECT t.*, 
       (CASE WHEN (t.x + t.y > t.z AND ABS(t.x - t.y) < t.z) 
       THEN 'Yes' ELSE 'No' END) 'triangle'
FROM triangle t;
'''
pd.read_sql_query(query, engine)

    x   y   z triangle
0  13  15  30       No
1  10  20  15      Yes